{
  "backend/main.mo": "Main canister actor defining task, project, mind dump, weekly review, and user profile types with authorization, state storage, and query/update methods.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding an empty dailyTasks map.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing routing, pages, components, hooks, and styling utilities.",
  "frontend/index.css": "Global Tailwind-based style layer defining OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Full app router setup with auth/guest guards, onboarding logic, profile-based accent color, and authenticated layout.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing max-width content area, optional bottom nav, and footer attribution.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with five primary app routes and active-state highlighting.",
  "frontend/src/components/FocusMode.tsx": "A full-screen focus timer for a task with pause/resume controls and a mark-done action.",
  "frontend/src/components/ProjectCard.tsx": "Displays a project with its name, task count, and progress bar, acting as a clickable card.",
  "frontend/src/components/TaskCard.tsx": "Shows task title, duration, energy level, and a button to enter focus mode.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user data like profiles, tasks, projects, and mind dumps.",
  "frontend/src/index.css": "Tailwind base styling defining light/dark theme CSS variables and global typography.",
  "frontend/src/main.tsx": "App bootstrap setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/ClarifyPage.tsx": "Guides users through clarifying mind dump items by marking them actionable, assigning details, or creating projects.",
  "frontend/src/pages/DashboardPage.tsx": "Shows today’s tasks with energy filtering and supports entering focus mode and marking tasks done.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login screen using Internet Identity and allows toggling info about authentication.",
  "frontend/src/pages/MindDumpPage.tsx": "Provides a textarea to capture unstructured thoughts and save or proceed to clarification.",
  "frontend/src/pages/OnboardingPage.tsx": "Implements a multi-step onboarding flow and saves the user profile with name and timezone.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits user profile settings including name, timezone, accent color, and energy preference.",
  "frontend/src/pages/ProjectsPage.tsx": "Shows the user's projects with task progress and a sheet to view tasks for a selected project.",
  "frontend/src/pages/WeeklyResetPage.tsx": "Collects weekly reflections, saves them, resets tasks, and navigates back to the dashboard.",
  "frontend/src/theme/accent.ts": "Converts a hex color to an OKLCH value and applies it as the primary accent color.",
  "frontend/src/utils/timezone.ts": "Detects the user's timezone with Intl API and falls back to UTC.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, store/retrieve them in sessionStorage, and clear them from the hash without reload.",
  "frontend/tailwind.config.js": "Configures Tailwind themes, colors, typography, container settings, animations, and includes common plugins.",
  "project_state.json": "Defines the project’s current state, version, architectural constraints, required features, and tracked issues for a multi‑user private app."
}